const students = [
    "Андрій Коваленко", "Марія Шевченко", "Олексій Іванов", "Ольга Петренко", 
    "Ігор Сидоренко", "Наталія Гончарук", "Віталій Литвиненко", "Юлія Данилюк", 
    "Дмитро Мельник", "Тетяна Кравчук", "Євген Лукашенко", "Віра Савченко", 
    "Олександр Ткаченко", "Анна Хоменко", "Максим Пономаренко", "Катерина Мороз", 
    "Сергій Тарасов", "Олена Кириленко", "Вадим Поліщук", "Ірина Чумак", 
    "Богдан Шульга", "Злата Федоренко", "Микола Руденко", "Софія Кушнір", 
    "Роман Бондар", "Лілія Шевцова", "Олексій Білоус", "Аліна Черненко", 
    "Василь Мазур", "Марина Соколова", "Тимур Литвин", "Олександра Жукова", 
    "Павло Гнатенко", "Інна Гриценко", "Артур Борисенко", "Надія Козак", 
    "Юрій Остапенко", "Дарина Ковальчук", "Віктор Гончаров", "Аліса Бойко", 
    "Степан Антонюк", "Оксана Козаченко", "Михайло Воронцов", "Ксенія Дорошенко", 
    "Ярослав Мельничук", "Вероніка Рибак", "Валентин Симоненко", "Емілія Гаврилюк", 
    "Іван Ткач", "Світлана Зайцева"
];

const input = document.querySelector("input");
const list = document.querySelector("ul");

const fillList = students.map((el) => `<li>${el}</li>`).join("");
list.insertAdjacentHTML("afterbegin", fillList)

function renderStudents(){
    let inputValue = input.value;
    let renderedStudents = students.filter((el) => el.includes(inputValue));
    let renderedList = renderedStudents.map((el) => `<li>${el}</li>`).join("");
    list.innerHTML = renderedList;
}

input.addEventListener("input", renderStudents);